---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GeometryInstance Properties
GeometryInstance Class See Also Send Feedback
---

The GeometryInstance type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle (Inherited from GeometryObject.) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. (Inherited from GeometryObject.) |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. (Inherited from GeometryObject.) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
|  | SymbolGeometry | The geometric representation of the symbol which generates this instance. |
|  | Transform | The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance. |
|  | Visibility | The visibility. (Inherited from GeometryObject.) |

# See Also

GeometryInstance Class

Autodesk.Revit.DB Namespace